## Pandas Series

In [170]:
import numpy as np
import pandas as pd

In [171]:
labels = ['a','b','c']
data = [10,20,30]

data_dict = {'a':10,'b':20,'c':30}

In [172]:
pd.Series(data=data, index=labels) # Press shift+tab for documentation

a    10
b    20
c    30
dtype: int64

In [173]:
pd.Series(data_dict) # Passing data dictionary to series

a    10
b    20
c    30
dtype: int64

In [174]:
pd.Series(data = data) # Passing only array to Series

0    10
1    20
2    30
dtype: int64

In [175]:
pd.Series(data = np.array(data))

0    10
1    20
2    30
dtype: int64

In [176]:
ser1 = pd.Series(data=[1,2,3,4],index=['USA','Germany','USSR','JAPAN'])
ser1

USA        1
Germany    2
USSR       3
JAPAN      4
dtype: int64

In [177]:
ser1['JAPAN']

4

In [178]:
ser2 = pd.Series([1,4,5,6],index=['USA','Germany','Italy','JAPAN'])
ser2

USA        1
Germany    4
Italy      5
JAPAN      6
dtype: int64

In [179]:
ser1 + ser2

Germany     6.0
Italy       NaN
JAPAN      10.0
USA         2.0
USSR        NaN
dtype: float64

## Data Frames part 1

In [180]:
from numpy.random import randn
np.random.seed(101)

rand_mat = randn(5,4)

In [181]:
rand_mat

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [182]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split(),columns='W X Y Z'.split()) # Press shift+tab for context guidance

In [183]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [184]:
df[['W','X']] # Selecting columns

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [185]:
df['W'] # Selecting one column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [186]:
df['NEW'] = df['W'] + df['Y'] # Hit tab for context guidance
df # creating new column

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [187]:
df.drop('NEW', axis=1) # Deleting new column. Axis=0 - rows, Axis=1 - columns. HUOM: deleting row doesn't
# actually delete a row. In order to delete permanently a row the option inplace=True to be used

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [188]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [189]:
df.drop('NEW', axis=1, inplace=True) # Now the row NEW was permanently deleted
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [190]:
df.drop(['X','Y'],axis=1) # Deleting multiple columns
# The same way rows are deleted, only axis option to be changed

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [191]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [192]:
df.loc['A'] # Selecting a row by name

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [193]:
df.iloc[0] # Selecting a row by index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [194]:
df.loc[['A','C']] # Selecting multiple rows by name

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001

In [195]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [196]:
df.loc[['A','B'],['W','X']] # Selecting A and B rows and W and X columns

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

## Data frames part 2

In [197]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [198]:
df > 0 # Conditional selection

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [199]:
df[df>0] # conditional selection non-boolean

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [200]:
df['W'] > 0 # Selecting from W-column values g.t. zero booleans

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [201]:
df[df['W']>0] # Selecting all data filtering on W-column and condition is g.t. 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [202]:
df[df['W']>0][['Y','Z']] # Selecting with same condition but only Y and Z columns

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
D -0.933237  0.955057
E  2.605967  0.683509

In [203]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [204]:
# Selecting with multiple conditions
df[(df['W'] > 0) & (df['Y'] > 1)] # Remember logical operations. Do not use and/or here, use instead & |
# Remember brackets as well around the conditions

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [205]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [206]:
# If I want A B C ... to be a column instead of an index
df.reset_index() # Again remember inplace option

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [207]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [208]:
# Lets make a new index column
new_ind = 'CA NY WY OR CO'.split()
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [209]:
df['States'] = new_ind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [210]:
# Let's now do colun 'States' to be our new index (row names)
df.set_index('States') # Remember inplace option

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [211]:
# Let's see summaries on our data frame
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
 4   States  5 non-null      object
dtypes: float64(4), object(1)
memory usage: 400.0+ bytes

In [212]:
df.dtypes

W         float64
X         float64
Y         float64
Z         float64
States     object
dtype: object

In [213]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean   0.343858  0.453764  0.452287  0.431871
std    1.681131  1.061385  1.454516  0.594708
min   -2.018168 -0.758872 -0.933237 -0.589001
25%    0.188695 -0.319318 -0.848077  0.503826
50%    0.190794  0.628133  0.528813  0.605965
75%    0.651118  0.740122  0.907969  0.683509
max    2.706850  1.978757  2.605967  0.955057

In [214]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [215]:
df['W'] > 0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [216]:
ser_w = df['W'] > 0
ser_w.value_counts()

True     4
False    1
Name: W, dtype: int64

In [217]:
np.sum(ser_w)

4

## Grouping data by

In [218]:
data = {'Company':'GOOG GOOG MSFT MSFT FB FB'.split(),
       'Person':'Sam Charlie Amy Vanessa Carl Sarah'.split(),
       'Sales':[200,120,340,124,243,350]}
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [219]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [220]:
df.groupby('Company').mean() # in the result Company name is the index for this particular data frame

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [221]:
# We can use as well describe()-method for grouped object
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Pandas operations

In [222]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':'abc def ghi xyz'.split()})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [223]:
# Let's figure out on unique values in a column
df['col2'].unique() # Returns array with only unique values

array([444, 555, 666])

In [224]:
df['col2'].nunique() # returns the number of unique values

3

In [225]:
# Number of instances per unique value
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [226]:
# Conditional selection from multiple columns
# col 1 > 2
# col2 == 444
newdf = df[(df['col1'] > 2) & (df['col2'] == 444)]
newdf

   col1  col2 col3
3     4   444  xyz

In [227]:
# Applying own function on each column
def times_two(number):
    return number*2

In [228]:
times_two(5)

10

In [229]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [230]:
# Let's apply this function to every single value in a column, e.g. column1
df['col1'].apply(times_two)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [231]:
# let's do a new column with the result
df['NEW'] = df['col1'].apply(times_two)
df

   col1  col2 col3  NEW
0     1   444  abc    2
1     2   555  def    4
2     3   666  ghi    6
3     4   444  xyz    8

In [232]:
# permanently remove a column
del df['NEW'] # df.drop is the same operation, but both rows and columns may be deleted

In [233]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [234]:
# Getting columns and indecies
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [235]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [236]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [237]:
df.describe()

           col1        col2
count  4.000000    4.000000
mean   2.500000  527.250000
std    1.290994  106.274409
min    1.000000  444.000000
25%    1.750000  444.000000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [238]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [239]:
#sorting data
df.sort_values(by='col2') # or df.sort_values('col2') ascending by default is True, if descending then set to False

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

## Data input and output

In [243]:
df = pd.read_csv('example.csv')

In [244]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [247]:
new_df = df.loc[[0,1],['b','c']]
new_df

   b  c
0  1  2
1  5  6

In [249]:
new_df.to_csv('filtered_csv.csv',index=False) # Save or not indexing column

In [253]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [254]:
df.drop('Unnamed: 0', axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [256]:
mylist_of_tables = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [258]:
type(mylist_of_tables)

list

In [259]:
len(mylist_of_tables)

1

In [262]:
df = mylist_of_tables[0]
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"